emacs/.config/emacs/config.org
#+TITLE: Dallas' Emacs Config
#+AUTHOR: A. Dallas Sherman
#+DESCRIPTION: Dallas' personal Emacs config
#+STARTUP: showeverything
#+OPTIONS: toc:2

* Table of Contents :toc:
- [[#generally-important-things][Generally Important Things]]
  - [[#load-scripts][Load Scripts]]
  - [[#evil-mode][Evil Mode]]
- [[#general-keybindings][General Keybindings]]
- [[#nerd-icons][Nerd Icons]]
- [[#auto-trash-backups][Auto-Trash Backups]]
- [[#diminish][Diminish]]
- [[#dired][Dired]]
- [[#flycheck-and-flymake][Flycheck and Flymake]]
- [[#fonts][Fonts]]
- [[#important-settings][Important Settings]]
  - [[#disable-menubar-toolbars-and-scrollbars][Disable Menubar, toolbars and scrollbars]]
  - [[#line-numbers-and-truncated-lines][Line Numbers and Truncated Lines]]
  - [[#disable-startup-screen][Disable startup screen]]
  - [[#sensible-defaults][Sensible defaults]]
- [[#ivy-counsel][Ivy (Counsel)]]
- [[#company][Company]]
- [[#languages][Languages]]
  - [[#lsp][LSP]]
  - [[#apheleia-formatting][Apheleia (FORMATTING)]]
- [[#minibuffer-escape][Minibuffer escape]]
- [[#modeline][Modeline]]
- [[#org-mode][Org Mode]]
  - [[#enabling-table-of-contents][Enabling Table of Contents]]
  - [[#enabling-org-bullets][Enabling Org Bullets]]
  - [[#source-code-extension][Source Code Extension]]
- [[#projectile][Projectile]]
- [[#rainbow-mode][Rainbow Mode]]
- [[#reload-emacs][Reload Emacs]]
- [[#shells-and-terms][Shells and Terms]]
  - [[#eshell][Eshell]]
  - [[#vterm][Vterm]]
  - [[#vterm-toggle][Vterm-Toggle]]
- [[#sudo-edit][Sudo Edit]]
- [[#theme][Theme]]
  - [[#themes-packages][Themes packages]]
  - [[#transparency][Transparency]]
- [[#which-key][Which-Key]]

* Generally Important Things 
** Load Scripts
*** Script Dir 
#+begin_src emacs-lisp
(add-to-list 'load-path "~/.config/emacs/scripts/")
#+end_src
*** Start scripts
#+begin_src emacs-lisp
(require 'elpaca-setup)  ;; The Elpaca Package Manager
(require 'buffer-move)   ;; Buffer-move for better window management
#+end_src

** Evil Mode
#+begin_src emacs-lisp
(use-package evil
  :ensure t
  :demand t
  :after elpaca
  :diminish
  :init
  (setq evil-want-integration t)
  (setq evil-want-keybinding nil)
  (setq evil-vsplit-window-right t)
  (setq evil-split-window-below t)
  (evil-mode))
(use-package evil-collection
  :after evil
  :diminish
  :ensure t
  :config
  (setq evil-collection-mode-list '(dashboard dired ibuffer))
  (evil-collection-init))
(use-package evil-tutor :ensure t :diminish)
(use-package evil-escape
  :ensure t
  :diminish
  :after evil
  :config
  (evil-escape-mode)
  (setq evil-escape-key-sequence "jk")
  (setq evil-escape-delay 0.2))
(use-package evil-surround
  :ensure t
  :config
  (global-evil-surround-mode 1))

;; Using RETURN to follow links in Org/Evil 
;; Unmap keys in 'evil-maps if not done, (setq org-return-follows-link t) will not work
(with-eval-after-load 'evil-maps
  (define-key evil-motion-state-map (kbd "SPC") nil)
  (define-key evil-motion-state-map (kbd "RET") nil)
  (define-key evil-motion-state-map (kbd "TAB") nil))
;; Setting RETURN key in org-mode to follow links
(setq org-return-follows-link  t)
#+end_src


* General Keybindings
#+begin_src emacs-lisp
(use-package general
  :ensure t
  :config
  (general-evil-setup)

  ;; set up 'SPC' as the global leader key
  (general-create-definer emacaroni/leader-key
    :states '(normal insert visual emacs)
    :keymaps 'override
    :prefix "SPC" ;; set leader
    :global-prefix "M-SPC") ;; access leader in insert mode
  
  ;; general
  (emacaroni/leader-key
    "SPC" '(find-file :wk "Find File")
    "/" '(counsel-M-x :wk "Counsel M-x")
    "co" '((lambda () (interactive) (find-file "~/.config/emacs/config.org")) :wk "Edit emacs config")
    "cr" '(reload-init-file :wk "Reload config")
    "fr" '(counsel-recentf :wk "Find recent files")
    "-" '(dired :wk "File Explorer (Dired)")
    "." '(counsel-fzf :wk "Fuzzy finder"))

   ;; org
   (emacaroni/leader-key
    "o" '(:ignore t :wk "Org")
    "o a" '(org-agenda :wk "Org agenda")
    "o e" '(org-export-dispatch :wk "Org export dispatch")
    "o i" '(org-toggle-item :wk "Org toggle item")
    "o t" '(org-todo :wk "Org todo")
    "o B" '(org-babel-tangel :wk "Org babel tangle")
    "o T" '(org-todo-list :wk "Org todo list")
    "o b" '(org-table-insert-hline :wk "Insert hline in table")
    "o d" '(org-time-stamp :wk "Org time stamp"))
    ;; buffer
    (emacaroni/leader-key
     "b" '(:ignore t :wk "Buffer")
     "bb" '(switch-to-buffer :wk "Switch buffer")
     "bk" '(kill-this-buffer :wk "Close current buffer")
     "bn" '(next-buffer :wk "Next buffer")
     "bp" '(previous-buffer :wk "Previous buffer")
     "bi" '(ibuffer :wk "IBuffer")
     "bd" '(evil-window-delete :wk "Close window")
     "bw" '(evil-window-new :wk "New window"))
    ;; splits
    (emacaroni/leader-key
      "s" '(:ignore t :wk "Split")
      "sh" '(evil-window-split :wk "New horizontal split")
      "sv" '(evil-window-vsplit :wk "New vertical split"))
    ;; dired
    (emacaroni/leader-key
     "d" '(:ignore t :wk "Dired")
     "dl" '(dired :wk "Open dired")
     "dj" '(dired-jump :wk "Dired jump to current")
     "dn" '(neotree-dir :wk "Open directory in neotree")
     "dp" '(peep-dired :wk "Peep-dired"))
    ;; evaluation
    (emacaroni/leader-key
     "e" '(:ignore t :wk "Evaluate")
     "eb" '(eval-buffer :wk "Evaluate elisp in buffer")
     "ed" '(eval-defun :wk "Evaluate defun containing or after point")
     "ee" '(eval-expression :wk "Evaluate an elisp expression")
     "el" '(eval-last-sexp :wk "Evaluate elisp expression before point")
     "er" '(eval-region :wk "Evaluate elisp in region"))
    ;; window
    (emacaroni/leader-key
     "w" '(:ignore t :wk "Window")
     "wn" '(evil-window-next :wk "Wind next")
     "wh" '(evil-window-left :wk "Window left")
     "wl" '(evil-window-right :wk "Window right")
     "wk" '(evil-window-up :wk "Window up")
     "wj" '(evil-window-down :wk "Window down")
     "wH" '(buf-move-left :wk "Buffer move left")
     "wJ" '(buf-move-down :wk "Buffer move down")
     "wK" '(buf-move-up :wk "Buffer move up")
     "wL" '(buf-move-right :wk "Buffer move right"))
    ;; toggles
    (emacaroni/leader-key
     "t" '(:ignore t :wk "Terminal")
     "tf" '(neotree-toggle :wk "Toggle neotree")
     "tl" '(visual-line-mode :wk "Toggle truncated lines")
     "tt" '(vterm-toggle :wk "Toggle vterm")
     "te" '(eshell :wk "Open eshell"))
    
    ;; projectile
    (emacaroni/leader-key
     "p" '(projectile-command-map :wk "Projectile"))
)

#+end_src

* Nerd Icons
#+begin_src emacs-lisp
(use-package nerd-icons
  :ensure t
  :if (display-graphic-p))

(use-package nerd-icons-dired
:ensure t
  :hook (dired-mode . (lambda () (nerd-icons-dired-mode t))))
(use-package nerd-icons-ibuffer
  :ensure t
  :hook (ibuffer-mode . nerd-icons-ibuffer-mode))
#+end_src

* Auto-Trash Backups
reduce the clutter in directories file.name~ by placing in the trash
#+begin_src emacs-lisp
(setq backup-directory-alits '((".a' ~/.Trash")))
#+end_src

* Diminish
#+begin_src emacs-lisp
(use-package diminish :ensure t)
#+end_src

* Dired
#+begin_src emacs-lisp
(use-package dired-open
  :ensure t
  :config
  (setq dired-open-extensions '(("gif" . "sxiv")
                                ("jpg" . "sxiv")
                                ("png" . "sxiv")
                                ("mkv" . "mpv")
                                ("mp4" . "mpv"))))

(use-package peep-dired
  :ensure t
  :after dired
  :hook (evil-normalize-keymaps . peep-dired-hook)
  :config
    (evil-define-key 'normal dired-mode-map (kbd "h") 'dired-up-directory)
    (evil-define-key 'normal dired-mode-map (kbd "ENTER") 'dired-open-file) ; use dired-find-file instead if not using dired-open package
    (evil-define-key 'normal peep-dired-mode-map (kbd "j") 'peep-dired-next-file)
    (evil-define-key 'normal peep-dired-mode-map (kbd "k") 'peep-dired-prev-file)
)

;;(add-hook 'peep-dired-hook 'evil-normalize-keymaps)

#+end_src

* Flycheck and Flymake
#+begin_src emacs-lisp
(use-package flycheck
  :ensure t
  :defer t
  :diminish
  :init (global-flycheck-mode))
(use-package flymake
  :ensure t
  :defer t
  :diminish)
#+end_src

